Revit 2026 API

# DirectShapeApplicationDataId Property

---

A text string that identifies the data to the creating application.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ApplicationDataId { get; set; }
```
```vb
Public Property ApplicationDataId As String
	Get
	Set
```
```cpp
public:
property String^ ApplicationDataId {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ApplicationDataId : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The intended use is to enable the creating application to identify the native data that was the source of this DirectShape. However, the creating application may use any text string as appropriate for its purposes, or leave this property unset.

#### Reference

DirectShape Class

Autodesk.Revit.DB Namespace